modules/private/prems-org/org-config.org
* The config.el

To tangle this file on the code block below press =C-c C-c= or =C-c C-v t=

#+begin_src elisp :tangle no :results ignore
(org-babel-tangle)
#+end_src


** Prelude
#+begin_src elisp :tangle config.el
;;;  -*- lexical-binding: t -*-
;; prems-org/config.el --- Configure what was loaded from prems-org/packages.el

#+end_src


* The packages.el

** Prelude
#+begin_src elisp :tangle packages.el
;;; -*- lexical-binding: t -*-
;; prems-org/packages.el ---  Additional ORG packages

#+end_src

** Org-Download

#+begin_src elisp :tangle packages.el

;;;
;; ORG-DOWNLOAD
;;   Helps with downloading images off the internet
;;;
(package! org-download
  :recipe (:host github
                 :repo "abo-abo/org-download")
  )
#+end_src

#+begin_src elisp :tangle packages.el
;;;
;; Mixed pitch to support varable width and fixed-width in the
;;  same buffer
;;;
(package! mixed-pitch)
#+end_src

#+begin_src elisp :tangle packages.el
;;;
;; ORG-APPEAR to reveal emphasis markers when moving the cursor over them
;;;
(package! org-appear
  :recipe (:host github
           :repo "awth13/org-appear"))

#+end_src

** Org show

An Alternative to 'org-present'

#+begin_src elisp :tangle packages.el
;;;
;; ORG-SHOW to reveal emphasis markers when moving the cursor over them
;;;
  (package! org-show
    :recipe (:local-repo (expand-file-name "lisp/org-show" doom-private-dir)
             :files ("org-show.el"))
    ;; :config
  )

(after! org
  (use-package! org-show)
 )

#+end_src


** Org Present

#+begin_src elisp :tangle packages.el
;;;
;; ORG-PRESENT
;;   Make any org file an presentation
;;;
(package! org-present)
(after! org
  (use-package! org-present)
  )
#+end_src

Corresponding configurations
#+begin_src elisp :tangle config.el
;;
;; Fixup org mode with variable pitch
;;
(after! org
  (add-hook! org-mode :append
             #'mixed-pitch-mode
           #'solaire-mode
           #'variable-pitch-mode)
  )
(setq mixed-pitch-variable-pitch-cursor nil)
#+end_src

Configure the start-end of presentation
#+begin_src elisp :tangle config.el
;;;
;;Setup org-present to start default setting
;;;
(after! org-present
  (setq-default org-present-text-scale 2)
  (add-hook 'org-present-mode-hook
            (lambda ()
              (org-present-big)
              (org-display-inline-images)
              (org-present-hide-cursor)
              (org-present-read-only)
              ;;(toggle-frame-fullscreen)
              ))
  (add-hook 'org-present-mode-quit-hook
            (lambda ()
              (org-present-small)
              (org-remove-inline-images)
              (org-present-show-cursor)
              (org-present-read-write)
              ;;(toggle-frame-fullscreen)
              )))
#+end_src
